while True:
    le = ['А','Б','Ц','Д','Е','Ф','Г','Х','И',
          'Й','К','Л','М','Н','О','П','Р','С',
          'Т','У','В','Ш','Щ','Ы','З','Э','Ж',
          'Ю','Я','0','1','2','3','4','5','6',
          '7','8','9']
    morse = ['.-', '-...', '-.-.', '-..', '.',
             '..-.', '--.', '....', '..', '.---',
             '-.-', '.-..', '--', '-.', '---', '.--.',
             '--.-', '.-.', '...', '-', '..-', '...-',
             '.--', '-..-', '-.--', '--..', '-----', '.----',
             '..---', '...--', 
             '....-', '.....', '-....', '--...', '---..', '----.']
    p=[]
    print('Если вам нужно перевести азбуку морзе на русский, нажмите л.')
    print('Если вам нужно перевести русские слова на азбуку морзе, нажмите д.')
    e = input()

    if e.lower() == 'л':
        t = input("Введите Морзе: ").split()
        for i in t:
            if i in morse:
                n = morse.index(i)
                l = le[n]
                p.append(l)
        print('в виде слова:', ''.join(p))

    elif e.lower() == 'д':
        t = input("Введите слова: ").upper()
        for i in t:
            if i in le:
                n = le.index(i)
                l = morse[n]
                p.append(l)
        print('в виде морзе:', ' '.join(p))    
    else:
        print("Вы ввели что-то другое")
